* Code block one
  Here we have some code
#+BEGIN_SRC python -n :results value :exports both :session icews
  x = 15
  y = 3

  if y < x:
      x = x + y
      return x
#+END_SRC

#+RESULTS:
: 18

* Code block two
Down here, we have even more code, but this time we will return an array.
#+BEGIN_SRC python -n :session icews
  import os
  import re

  list = ['red','blue','green','yellow','black']
  list.append('magenta')

  return x + y
#+END_SRC

#+RESULTS:
